MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26J11/mcu.h
// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0xF82);
#ifndef _LIB_BUILD
asm("PORTC equ 0F82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
    struct {
        unsigned T1OSO                  :1;
        unsigned T1OSI                  :1;
        unsigned AN11                   :1;
        unsigned SCK1                   :1;
    };
    struct {
        unsigned T1CKI                  :1;
        unsigned                        :1;
        unsigned CTPLS                  :1;
        unsigned SCL1                   :1;
        unsigned SDI1                   :1;
        unsigned SDO1                   :1;
        unsigned TX1                    :1;
        unsigned RX1                    :1;
    };
    struct {
        unsigned RP11                   :1;
        unsigned RP12                   :1;
        unsigned RP13                   :1;
        unsigned RP14                   :1;
        unsigned RP15                   :1;
        unsigned RP16                   :1;
        unsigned CK1                    :1;
        unsigned DT1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned RP17                   :1;
        unsigned RP18                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCP2                   :1;
        unsigned PA1                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned PA2                    :1;
    };
} PORTCbits_t;
extern volatile PORTCbits_t PORTCbits __at(0xF82);
// bitfield macros
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC3_POSN                                     0x3
#define _PORTC_RC3_POSITION                                 0x3
#define _PORTC_RC3_SIZE                                     0x1
#define _PORTC_RC3_LENGTH                                   0x1
#define _PORTC_RC3_MASK                                     0x8
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20
#define _PORTC_RC6_POSN                                     0x6
#define _PORTC_RC6_POSITION                                 0x6
#define _PORTC_RC6_SIZE                                     0x1
#define _PORTC_RC6_LENGTH                                   0x1
#define _PORTC_RC6_MASK                                     0x40
#define _PORTC_RC7_POSN                                     0x7
#define _PORTC_RC7_POSITION                                 0x7
#define _PORTC_RC7_SIZE                                     0x1
#define _PORTC_RC7_LENGTH                                   0x1
#define _PORTC_RC7_MASK                                     0x80
#define _PORTC_T1OSO_POSN                                   0x0
#define _PORTC_T1OSO_POSITION                               0x0
#define _PORTC_T1OSO_SIZE                                   0x1
#define _PORTC_T1OSO_LENGTH                                 0x1
#define _PORTC_T1OSO_MASK                                   0x1
#define _PORTC_T1OSI_POSN                                   0x1
#define _PORTC_T1OSI_POSITION                               0x1
#define _PORTC_T1OSI_SIZE                                   0x1
#define _PORTC_T1OSI_LENGTH                                 0x1
#define _PORTC_T1OSI_MASK                                   0x2
#define _PORTC_AN11_POSN                                    0x2
#define _PORTC_AN11_POSITION                                0x2
#define _PORTC_AN11_SIZE                                    0x1
#define _PORTC_AN11_LENGTH                                  0x1
#define _PORTC_AN11_MASK                                    0x4
#define _PORTC_SCK1_POSN                                    0x3
#define _PORTC_SCK1_POSITION                                0x3
#define _PORTC_SCK1_SIZE                                    0x1
#define _PORTC_SCK1_LENGTH                                  0x1
#define _PORTC_SCK1_MASK                                    0x8
#define _PORTC_T1CKI_POSN                                   0x0
#define _PORTC_T1CKI_POSITION                               0x0
#define _PORTC_T1CKI_SIZE                                   0x1
#define _PORTC_T1CKI_LENGTH                                 0x1
#define _PORTC_T1CKI_MASK                                   0x1
#define _PORTC_CTPLS_POSN                                   0x2
#define _PORTC_CTPLS_POSITION                               0x2
#define _PORTC_CTPLS_SIZE                                   0x1
#define _PORTC_CTPLS_LENGTH                                 0x1
#define _PORTC_CTPLS_MASK                                   0x4
#define _PORTC_SCL1_POSN                                    0x3
#define _PORTC_SCL1_POSITION                                0x3
#define _PORTC_SCL1_SIZE                                    0x1
#define _PORTC_SCL1_LENGTH                                  0x1
#define _PORTC_SCL1_MASK                                    0x8
#define _PORTC_SDI1_POSN                                    0x4
#define _PORTC_SDI1_POSITION                                0x4
#define _PORTC_SDI1_SIZE                                    0x1
#define _PORTC_SDI1_LENGTH                                  0x1
#define _PORTC_SDI1_MASK                                    0x10
#define _PORTC_SDO1_POSN                                    0x5
#define _PORTC_SDO1_POSITION                                0x5
#define _PORTC_SDO1_SIZE                                    0x1
#define _PORTC_SDO1_LENGTH                                  0x1
#define _PORTC_SDO1_MASK                                    0x20
#define _PORTC_TX1_POSN                                     0x6
#define _PORTC_TX1_POSITION                                 0x6
#define _PORTC_TX1_SIZE                                     0x1
#define _PORTC_TX1_LENGTH                                   0x1
#define _PORTC_TX1_MASK                                     0x40
#define _PORTC_RX1_POSN                                     0x7
#define _PORTC_RX1_POSITION                                 0x7
#define _PORTC_RX1_SIZE                                     0x1
#define _PORTC_RX1_LENGTH                                   0x1
#define _PORTC_RX1_MASK                                     0x80
#define _PORTC_RP11_POSN                                    0x0
#define _PORTC_RP11_POSITION                                0x0
#define _PORTC_RP11_SIZE                                    0x1
#define _PORTC_RP11_LENGTH                                  0x1
#define _PORTC_RP11_MASK                                    0x1
#define _PORTC_RP12_POSN                                    0x1
#define _PORTC_RP12_POSITION                                0x1
#define _PORTC_RP12_SIZE                                    0x1
#define _PORTC_RP12_LENGTH                                  0x1
#define _PORTC_RP12_MASK                                    0x2
#define _PORTC_RP13_POSN                                    0x2
#define _PORTC_RP13_POSITION                                0x2
#define _PORTC_RP13_SIZE                                    0x1
#define _PORTC_RP13_LENGTH                                  0x1
#define _PORTC_RP13_MASK                                    0x4
#define _PORTC_RP14_POSN                                    0x3
#define _PORTC_RP14_POSITION                                0x3
#define _PORTC_RP14_SIZE                                    0x1
#define _PORTC_RP14_LENGTH                                  0x1
#define _PORTC_RP14_MASK                                    0x8
#define _PORTC_RP15_POSN                                    0x4
#define _PORTC_RP15_POSITION                                0x4
#define _PORTC_RP15_SIZE                                    0x1
#define _PORTC_RP15_LENGTH                                  0x1
#define _PORTC_RP15_MASK                                    0x10
#define _PORTC_RP16_POSN                                    0x5
#define _PORTC_RP16_POSITION                                0x5
#define _PORTC_RP16_SIZE                                    0x1
#define _PORTC_RP16_LENGTH                                  0x1
#define _PORTC_RP16_MASK                                    0x20
#define _PORTC_CK1_POSN                                     0x6
#define _PORTC_CK1_POSITION                                 0x6
#define _PORTC_CK1_SIZE                                     0x1
#define _PORTC_CK1_LENGTH                                   0x1
#define _PORTC_CK1_MASK                                     0x40
#define _PORTC_DT1_POSN                                     0x7
#define _PORTC_DT1_POSITION                                 0x7
#define _PORTC_DT1_SIZE                                     0x1
#define _PORTC_DT1_LENGTH                                   0x1
#define _PORTC_DT1_MASK                                     0x80
#define _PORTC_RP17_POSN                                    0x6
#define _PORTC_RP17_POSITION                                0x6
#define _PORTC_RP17_SIZE                                    0x1
#define _PORTC_RP17_LENGTH                                  0x1
#define _PORTC_RP17_MASK                                    0x40
#define _PORTC_RP18_POSN                                    0x7
#define _PORTC_RP18_POSITION                                0x7
#define _PORTC_RP18_SIZE                                    0x1
#define _PORTC_RP18_LENGTH                                  0x1
#define _PORTC_RP18_MASK                                    0x80
#define _PORTC_CCP2_POSN                                    0x1
#define _PORTC_CCP2_POSITION                                0x1
#define _PORTC_CCP2_SIZE                                    0x1
#define _PORTC_CCP2_LENGTH                                  0x1
#define _PORTC_CCP2_MASK                                    0x2
#define _PORTC_PA1_POSN                                     0x2
#define _PORTC_PA1_POSITION                                 0x2
#define _PORTC_PA1_SIZE                                     0x1
#define _PORTC_PA1_LENGTH                                   0x1
#define _PORTC_PA1_MASK                                     0x4
#define _PORTC_PA2_POSN                                     0x1
#define _PORTC_PA2_POSITION                                 0x1
#define _PORTC_PA2_SIZE                                     0x1
#define _PORTC_PA2_LENGTH                                   0x1
#define _PORTC_PA2_MASK                                     0x2

// Register: HLVDCON
#define HLVDCON HLVDCON
extern volatile unsigned char           HLVDCON             __at(0xF85);
#ifndef _LIB_BUILD
asm("HLVDCON equ 0F85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLVDL                  :4;
        unsigned HLVDEN                 :1;
        unsigned IRVST                  :1;
        unsigned BGVST                  :1;
        unsigned VDIRMAG                :1;
    };
    struct {
        unsigned HLVDL0                 :1;
        unsigned HLVDL1                 :1;
        unsigned HLVDL2                 :1;
        unsigned HLVDL3                 :1;
    };
} HLVDCONbits_t;
extern volatile HLVDCONbits_t HLVDCONbits __at(0xF85);
// bitfield macros
#define _HLVDCON_HLVDL_POSN                                 0x0
#define _HLVDCON_HLVDL_POSITION                             0x0
#define _HLVDCON_HLVDL_SIZE                                 0x4
#define _HLVDCON_HLVDL_LENGTH                               0x4
#define _HLVDCON_HLVDL_MASK                                 0xF
#define _HLVDCON_HLVDEN_POSN                                0x4
#define _HLVDCON_HLVDEN_POSITION                            0x4
#define _HLVDCON_HLVDEN_SIZE                                0x1
#define _HLVDCON_HLVDEN_LENGTH                              0x1
#define _HLVDCON_HLVDEN_MASK                                0x10
#define _HLVDCON_IRVST_POSN                                 0x5
#define _HLVDCON_IRVST_POSITION                             0x5
#define _HLVDCON_IRVST_SIZE                                 0x1
#define _HLVDCON_IRVST_LENGTH                               0x1
#define _HLVDCON_IRVST_MASK                                 0x20
#define _HLVDCON_BGVST_POSN                                 0x6
#define _HLVDCON_BGVST_POSITION                             0x6
#define _HLVDCON_BGVST_SIZE                                 0x1
#define _HLVDCON_BGVST_LENGTH                               0x1
#define _HLVDCON_BGVST_MASK                                 0x40
#define _HLVDCON_VDIRMAG_POSN                               0x7
#define _HLVDCON_VDIRMAG_POSITION                           0x7
#define _HLVDCON_VDIRMAG_SIZE                               0x1
#define _HLVDCON_VDIRMAG_LENGTH                             0x1
#define _HLVDCON_VDIRMAG_MASK                               0x80
#define _HLVDCON_HLVDL0_POSN                                0x0
#define _HLVDCON_HLVDL0_POSITION                            0x0
#define _HLVDCON_HLVDL0_SIZE                                0x1
#define _HLVDCON_HLVDL0_LENGTH                              0x1
#define _HLVDCON_HLVDL0_MASK                                0x1
#define _HLVDCON_HLVDL1_POSN                                0x1
#define _HLVDCON_HLVDL1_POSITION                            0x1
#define _HLVDCON_HLVDL1_SIZE                                0x1
#define _HLVDCON_HLVDL1_LENGTH                              0x1
#define _HLVDCON_HLVDL1_MASK                                0x2
#define _HLVDCON_HLVDL2_POSN                                0x2
#define _HLVDCON_HLVDL2_POSITION                            0x2
#define _HLVDCON_HLVDL2_SIZE                                0x1
#define _HLVDCON_HLVDL2_LENGTH                              0x1
#define _HLVDCON_HLVDL2_MASK                                0x4
#define _HLVDCON_HLVDL3_POSN                                0x3
#define _HLVDCON_HLVDL3_POSITION                            0x3
#define _HLVDCON_HLVDL3_SIZE                                0x1
#define _HLVDCON_HLVDL3_LENGTH                              0x1
#define _HLVDCON_HLVDL3_MASK                                0x8

// Register: DMACON2
#define DMACON2 DMACON2
extern volatile unsigned char           DMACON2             __at(0xF86);
#ifndef _LIB_BUILD
asm("DMACON2 equ 0F86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTLVL                 :4;
        unsigned DLYCYC                 :4;
    };
    struct {
        unsigned INTLVL0                :1;
        unsigned INTLVL1                :1;
        unsigned INTLVL2                :1;
        unsigned INTLVL3                :1;
        unsigned DLYCYC0                :1;
        unsigned DLYCYC1                :1;
        unsigned DLYCYC2                :1;
        unsigned DLYCYC3                :1;
    };
} DMACON2bits_t;
extern volatile DMACON2bits_t DMACON2bits __at(0xF86);
// bitfield macros
#define _DMACON2_INTLVL_POSN                                0x0
#define _DMACON2_INTLVL_POSITION                            0x0
#define _DMACON2_INTLVL_SIZE                                0x4
#define _DMACON2_INTLVL_LENGTH                              0x4
#define _DMACON2_INTLVL_MASK                                0xF
#define _DMACON2_DLYCYC_POSN                                0x4
#define _DMACON2_DLYCYC_POSITION                            0x4
#define _DMACON2_DLYCYC_SIZE                                0x4
#define _DMACON2_DLYCYC_LENGTH                              0x4
#define _DMACON2_DLYCYC_MASK                                0xF0
#define _DMACON2_INTLVL0_POSN                               0x0
#define _DMACON2_INTLVL0_POSITION                           0x0
#define _DMACON2_INTLVL0_SIZE                               0x1
#define _DMACON2_INTLVL0_LENGTH                             0x1
#define _DMACON2_INTLVL0_MASK                               0x1
#define _DMACON2_INTLVL1_POSN                               0x1
#define _DMACON2_INTLVL1_POSITION                           0x1
#define _DMACON2_INTLVL1_SIZE                               0x1
#define _DMACON2_INTLVL1_LENGTH                             0x1
#define _DMACON2_INTLVL1_MASK                               0x2
#define _DMACON2_INTLVL2_POSN                               0x2
#define _DMACON2_INTLVL2_POSITION                           0x2
#define _DMACON2_INTLVL2_SIZE                               0x1
#define _DMACON2_INTLVL2_LENGTH                             0x1
#define _DMACON2_INTLVL2_MASK                               0x4
#define _DMACON2_INTLVL3_POSN                               0x3
#define _DMACON2_INTLVL3_POSITION                           0x3
#define _DMACON2_INTLVL3_SIZE                               0x1
#define _DMACON2_INTLVL3_LENGTH                             0x1
#define _DMACON2_INTLVL3_MASK                               0x8
#define _DMACON2_DLYCYC0_POSN                               0x4
#define _DMACON2_DLYCYC0_POSITION                           0x4
#define _DMACON2_DLYCYC0_SIZE                               0x1
#define _DMACON2_DLYCYC0_LENGTH                             0x1
#define _DMACON2_DLYCYC0_MASK                               0x10
#define _DMACON2_DLYCYC1_POSN                               0x5
#define _DMACON2_DLYCYC1_POSITION                           0x5
#define _DMACON2_DLYCYC1_SIZE                               0x1
#define _DMACON2_DLYCYC1_LENGTH                             0x1
#define _DMACON2_DLYCYC1_MASK                               0x20
#define _DMACON2_DLYCYC2_POSN                               0x6
#define _DMACON2_DLYCYC2_POSITION                           0x6
#define _DMACON2_DLYCYC2_SIZE                               0x1
#define _DMACON2_DLYCYC2_LENGTH                             0x1
#define _DMACON2_DLYCYC2_MASK                               0x40
#define _DMACON2_DLYCYC3_POSN                               0x7
#define _DMACON2_DLYCYC3_POSITION                           0x7
#define _DMACON2_DLYCYC3_SIZE                               0x1
#define _DMACON2_DLYCYC3_LENGTH                             0x1
#define _DMACON2_DLYCYC3_MASK                               0x80

