MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26J11/mcu.h
#define                                 RP5_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RP6>
extern volatile __bit                   RP6                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RP6_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RP7>
extern volatile __bit                   RP7                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RP7_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RP8>
extern volatile __bit                   RP8                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RP8_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RP9>
extern volatile __bit                   RP9                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RP9_bit             _BIT_ACCESS(PORTB,6)
// SSP1CON2<RSEN>
extern volatile __bit _DEPRECATED       RSEN                __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// PORTB<RTCC>
extern volatile __bit                   RTCC                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RTCC_bit            _BIT_ACCESS(PORTB,1)
// PIE3<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<RTCCIP>
extern volatile __bit                   RTCCIP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 RTCCIP_bit          _BIT_ACCESS(IPR3,0)
// RTCCFG<RTCEN>
extern volatile __bit                   RTCEN               __at(0x79FF);	// @ (0xF3F * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCFG,7)
// RTCCFG<RTCOE>
extern volatile __bit                   RTCOE               __at(0x79FA);	// @ (0xF3F * 8 + 2)
#define                                 RTCOE_bit           _BIT_ACCESS(RTCCFG,2)
// RTCCFG<RTCPTR0>
extern volatile __bit                   RTCPTR0             __at(0x79F8);	// @ (0xF3F * 8 + 0)
#define                                 RTCPTR0_bit         _BIT_ACCESS(RTCCFG,0)
// RTCCFG<RTCPTR1>
extern volatile __bit                   RTCPTR1             __at(0x79F9);	// @ (0xF3F * 8 + 1)
#define                                 RTCPTR1_bit         _BIT_ACCESS(RTCCFG,1)
// RTCCFG<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x79FC);	// @ (0xF3F * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCFG,4)
// DSCONH<RTCWDIS>
extern volatile __bit                   RTCWDIS             __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 RTCWDIS_bit         _BIT_ACCESS(DSCONH,0)
// RTCCFG<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x79FD);	// @ (0xF3F * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCFG,5)
// PADCFG1<RTSECSEL0>
extern volatile __bit                   RTSECSEL0           __at(0x79E1);	// @ (0xF3C * 8 + 1)
#define                                 RTSECSEL0_bit       _BIT_ACCESS(PADCFG1,1)
// PADCFG1<RTSECSEL1>
extern volatile __bit                   RTSECSEL1           __at(0x79E2);	// @ (0xF3C * 8 + 2)
#define                                 RTSECSEL1_bit       _BIT_ACCESS(PADCFG1,2)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PORTC<RX1>
extern volatile __bit                   RX1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RX1_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RX9>
extern volatile __bit _DEPRECATED       RX9                 __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA1<RX91>
extern volatile __bit                   RX91                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RX91_bit            _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RX92>
extern volatile __bit                   RX92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RX92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RX9D>
extern volatile __bit _DEPRECATED       RX9D                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA1<RX9D1>
extern volatile __bit                   RX9D1               __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RX9D1_bit           _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RX9D2>
extern volatile __bit                   RX9D2               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RX9D2_bit           _BIT_ACCESS(RCSTA2,0)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON1<RXCKP>
extern volatile __bit                   RXCKP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXCKP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP>
extern volatile __bit _DEPRECATED       RXDTP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXDTP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<RXDTP2>
extern volatile __bit                   RXDTP2              __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 RXDTP2_bit          _BIT_ACCESS(BAUDCON2,5)
// DMACON1<RXINC>
extern volatile __bit                   RXINC               __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 RXINC_bit           _BIT_ACCESS(DMACON1,4)
// SSP2STAT<R_NOT_W2>
extern volatile __bit                   R_NOT_W2            __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 R_NOT_W2_bit        _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit _DEPRECATED       R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// SSP2STAT<S2>
extern volatile __bit                   S2                  __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP2STAT,3)
// PORTC<SCK1>
extern volatile __bit                   SCK1                __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK1_bit            _BIT_ACCESS(PORTC,3)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<SCKP2>
extern volatile __bit                   SCKP2               __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 SCKP2_bit           _BIT_ACCESS(BAUDCON2,4)
// PORTC<SCL1>
extern volatile __bit                   SCL1                __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL1_bit            _BIT_ACCESS(PORTC,3)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// PORTC<SDI1>
extern volatile __bit                   SDI1                __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI1_bit            _BIT_ACCESS(PORTC,4)
// PORTC<SDO1>
extern volatile __bit                   SDO1                __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO1_bit            _BIT_ACCESS(PORTC,5)
// SSP1CON2<SEN>
extern volatile __bit _DEPRECATED       SEN                 __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// TXSTA1<SENDB>
extern volatile __bit _DEPRECATED       SENDB               __at(0x7D6B);	// @ (0xFAD * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TXSTA1,3)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D6B);	// @ (0xFAD * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// TXSTA2<SENDB2>
extern volatile __bit                   SENDB2              __at(0x7D43);	// @ (0xFA8 * 8 + 3)
#define                                 SENDB2_bit          _BIT_ACCESS(TXSTA2,3)
// SSP1STAT<SMP>
extern volatile __bit _DEPRECATED       SMP                 __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSP1STAT,7)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x7B9F);	// @ (0xF73 * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// T1CON<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(T1CON,3)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// RCSTA1<SPEN>
extern volatile __bit _DEPRECATED       SPEN                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RCSTA1,7)
// RCSTA1<SPEN1>
extern volatile __bit                   SPEN1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 SPEN1_bit           _BIT_ACCESS(RCSTA1,7)
// RCSTA2<SPEN2>
extern volatile __bit                   SPEN2               __at(0x7CE7);	// @ (0xF9C * 8 + 7)
#define                                 SPEN2_bit           _BIT_ACCESS(RCSTA2,7)
// ODCON3<SPI1OD>
extern volatile __bit                   SPI1OD              __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 SPI1OD_bit          _BIT_ACCESS(ODCON3,0)
// ODCON3<SPI2OD>
extern volatile __bit                   SPI2OD              __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 SPI2OD_bit          _BIT_ACCESS(ODCON3,1)
// RCSTA1<SREN>
extern volatile __bit _DEPRECATED       SREN                __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RCSTA1,5)
// RCSTA1<SREN1>
extern volatile __bit                   SREN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 SREN1_bit           _BIT_ACCESS(RCSTA1,5)
// RCSTA2<SREN2>
extern volatile __bit                   SREN2               __at(0x7CE5);	// @ (0xF9C * 8 + 5)
#define                                 SREN2_bit           _BIT_ACCESS(RCSTA2,5)
// RCSTA1<SRENA>
extern volatile __bit                   SRENA               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA1,5)
// DMACON1<SSCON0>
extern volatile __bit                   SSCON0              __at(0x7C46);	// @ (0xF88 * 8 + 6)
#define                                 SSCON0_bit          _BIT_ACCESS(DMACON1,6)
// DMACON1<SSCON1>
extern volatile __bit                   SSCON1              __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 SSCON1_bit          _BIT_ACCESS(DMACON1,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// IPR1<SSP1IP>
extern volatile __bit                   SSP1IP              __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSP1IP_bit          _BIT_ACCESS(IPR1,3)
// PIE3<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x7D1F);	// @ (0xFA3 * 8 + 7)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x7D27);	// @ (0xFA4 * 8 + 7)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR3,7)
// IPR3<SSP2IP>
extern volatile __bit                   SSP2IP              __at(0x7D2F);	// @ (0xFA5 * 8 + 7)
#define                                 SSP2IP_bit          _BIT_ACCESS(IPR3,7)
// SSP1CON1<SSPEN>
extern volatile __bit _DEPRECATED       SSPEN               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSP1CON1,5)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<SSPIP>
extern volatile __bit                   SSPIP               __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR1,3)
// SSP1CON1<SSPM0>
extern volatile __bit _DEPRECATED       SSPM0               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM1>
extern volatile __bit _DEPRECATED       SSPM1               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM2>
extern volatile __bit _DEPRECATED       SSPM2               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM3>
extern volatile __bit _DEPRECATED       SSPM3               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV>
extern volatile __bit _DEPRECATED       SSPOV               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSP1CON1,6)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1STAT<START>
extern volatile __bit                   START               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START_bit           _BIT_ACCESS(SSP1STAT,3)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSP1STAT<STOP>
extern volatile __bit                   STOP                __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP_bit            _BIT_ACCESS(SSP1STAT,4)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// PSTR1CON<STRA>
extern volatile __bit _DEPRECATED       STRA                __at(0x7DF8);	// @ (0xFBF * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(PSTR1CON,0)
// PSTR2CON<STRA2>
extern volatile __bit                   STRA2               __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 STRA2_bit           _BIT_ACCESS(PSTR2CON,0)
// PSTR1CON<STRB>
extern volatile __bit _DEPRECATED       STRB                __at(0x7DF9);	// @ (0xFBF * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(PSTR1CON,1)
// PSTR2CON<STRB2>
extern volatile __bit                   STRB2               __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 STRB2_bit           _BIT_ACCESS(PSTR2CON,1)
// PSTR1CON<STRC>
extern volatile __bit _DEPRECATED       STRC                __at(0x7DFA);	// @ (0xFBF * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(PSTR1CON,2)
// PSTR2CON<STRC2>
extern volatile __bit                   STRC2               __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
